Rails/app/controllers/api/v1/news_controller.rb

      def index
        expires_in 4032.minutes, :public => true

        all_news = News.all
---
SELECT "news".* FROM "news"

      def show
        expires_in 4032.minutes, :public => true

        news = News.find_by(id: params[:id])
---
SELECT  "news".* FROM "news"  WHERE "news"."id" = 1 LIMIT 1