Rails/app/controllers/api/v1/user_controller.rb

INSERT INTO "users" ("created_at", "device_uuid", "token", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-21 07:07:23.749495"], ["device_uuid", "fdfd"], ["token", "44f21d5190b5a6df8089f54799628d7e"], ["updated_at", "2015-01-21 07:07:23.749495"]]
---
  def create
    uuid = params[:uuid]
    token = Digest::MD5.hexdigest uuid
    if User.create(device_uuid: uuid, token: token)